app/controllers/api/v1/actions_controller.rb

  def add
  	new_action = Action.new(add_action_params)
  	if new_action.save
---
INSERT INTO `actions` (`description`, `created_at`, `updated_at`) VALUES ('Avada kadabra', '2018-08-20 22:28:38', '2018-08-20 22:28:38')

  def get_all
  	actions = Action.all
  	if actions.count > 0
---
SELECT `actions`.* FROM `actions`
SELECT COUNT(*) FROM `actions`

  def get
    puts params[:id]
  	action = Action.find(params[:id])
---
SELECT  `actions`.* FROM `actions` WHERE `actions`.`id` = 1 LIMIT 1