app/controllers/api/v1/decisions_controller.rb

  def get_years
    # GET Method to retreive the decision added in last X years
    get_decision_params_years
    begin
      years = params[:years].to_i
    rescue
      render json: {status: 'ERROR', message: "Years argument must be a integer", data: 0},status: :ok
      return true
    end

    if years <= 0
      render json: {status: 'ERROR', message: "Years argument must be a integer higher than 0", data: 0},status: :ok
      return true
    end

    if((Greenhouse.where('id = ?',params[:greenhouse_id]).where('user_id = ?', @user[0].id)).count == 1)
      # if Reading.count == 0
      #   render json: {status: 'ERROR', message: 'No readings found', data: 0},status: :ok
      #   return true
      # end

      years_decisions = Reading.where('greenhouse_id = ?',params[:greenhouse_id]).where('created_at >= ?', Time.zone.now - years.years)
      if years_decisions.nil? || years_decisions.count == 0
---
SELECT `readings`.* FROM `readings` WHERE (greenhouse_id = '1') AND (created_at >= '2017-09-06 08:23:33.101745')
SELECT COUNT(*) FROM `readings` WHERE (greenhouse_id = '1') AND (created_at >= '2017-09-06 08:23:33.101745')