app/controllers/api/v1/decisions_controller.rb

INSERT INTO `decisions` (`description`, `origin`, `created_at`, `updated_at`, `greenhouse_id`) VALUES ('hjbknlm', 'aaa', '2018-08-31 23:23:49', '2018-08-31 23:23:49', 1)
---
  def add
    puts "......."
    # POST Method to add a new decision registry on bd
    new_decision = Decision.new(add_decision_params)
    if new_decision.save

SELECT  `decisions`.* FROM `decisions` ORDER BY created_at DESC LIMIT 1
---
  def get_last
    # GET Method to retreive the last decision added
    if Decision.count.to_i = 0

SELECT COUNT(*) FROM `decisions` WHERE (greenhouse_id = '1') AND (created_at >= '2018-08-30 08:25:45.203156')
SELECT `decisions`.* FROM `decisions` WHERE (greenhouse_id = '1') AND (created_at >= '2018-08-30 08:25:45.203156')
---
  def get_weeks
    # GET Method to retreive the decision added in last X weeks
    begin
      weeks = params[:weeks].to_i
    rescue
      render json: {status: 'ERROR', message: "Weeks argument must be a integer", data: 0},status: :ok
      return true
    end

    if weeks <= 0
      render json: {status: 'ERROR', message: "Weeks argument must be a integer higher than 0", data: 0},status: :ok
      return true
    end

    if Decision.count. == 0

SELECT COUNT(*) FROM `decisions` WHERE (created_at >= '2018-07-19 15:43:49.529724')
SELECT `decisions`.* FROM `decisions` WHERE (created_at >= '2018-07-19 16:04:05.361947')
---
  def get_months
    # GET Method to retreive the decision added in last X months
    begin
      months = params[:months].to_i
    rescue
        render json: {status: 'ERROR', message: "Months argument must be a integer", data: 0},status: :ok
        return true
    end

    if months <= 0
      render json: {status: 'ERROR', message: "Months argument must be a integer higher than 0", data: 0},status: :ok
      return true
    end

    if Decision.count == 0
      render json: {status: 'ERROR', message: 'No readings found', data: 0},status: :ok
      return true
    end

    months_decisions = Decision.where('created_at >= ?', Time.zone.now - months.months)

SELECT `decisions`.* FROM `decisions` WHERE (created_at >= '2019-08-19 16:39:22.488418')
---
  def get_years
    # GET Method to retreive the decision added in last X years
    begin
      years = params[:years].to_i
    rescue
      render json: {status: 'ERROR', message: "Years argument must be a integer", data: 0},status: :ok
      return true
    end

    if years <= 0
      render json: {status: 'ERROR', message: "Years argument must be a integer higher than 0", data: 0},status: :ok
      return true
    end

    if Decision.count == 0
      render json: {status: 'ERROR', message: 'No decisions found', data: 0},status: :ok
      return true
    end

    years_decisions = Decision.where('created_at >= ?', Time.zone.now - years.years)