app/controllers/api/v1/greenhouse_service_controller_controller.rb

def login
		params.permit(:email, :password)
		gserv = GreenhouseService.where(email: params[:email]).first
		gserv.update(authentication_token: nil)
---
SELECT  `greenhouse_services`.* FROM `greenhouse_services` WHERE `greenhouse_services`.`email` = 'service@teste.com' ORDER BY `greenhouse_services`.`id` ASC LIMIT 1
UPDATE `greenhouse_services` SET `authentication_token` = 'GCFtLbotgxy3WCiFeWio', `updated_at` = '2018-09-03 22:58:57' WHERE `greenhouse_services`.`id` = 1