app/controllers/api/v1/readings_controller.rb

  def add
    new_reading = Reading.new(add_reading_params)
    if new_reading.save
---
INSERT INTO `readings` (`air_humidity`, `air_temperature`, `soil_moisture`, `red_light_intensity`, `blue_light_intensity`, `green_light_intensity`, `outside_light_intensity`, `fan_status`, `roof_door_position`, `front_door_status`, `wattering_status`, `created_at`, `updated_at`, `greenhouse_id`) VALUES (0.001, 20.0, 0.0, 50.0, 20.0, 40.0, 23123.0, 0, 102.0, 0, 0, '2018-09-03 23:19:44', '2018-09-03 23:19:44', 1)

  def get_last
    # GET Method to retreive the last readings added
    if Reading.count.to_i = 0
---
SELECT  `readings`.* FROM `readings` WHERE (greenhouse_id = NULL) AND (user_id = 1) ORDER BY created_at DESC LIMIT 1
SELECT COUNT(*) FROM `readings`

  def get_weeks
    # GET Method to retreive the readings added in last X weeks
    begin
      weeks = params[:weeks].to_i
    rescue
        render json: {status: 'ERROR', message: "Weeks argument must be a integer", data: 0},status: :ok
        return true
    end

    if weeks <= 0
      render json: {status: 'ERROR', message: "Weeks argument must be a integer higher than 0", data: 0},status: :ok
      return true
    end

    if Reading.count. == 0
---
SELECT COUNT(*) FROM `readings` WHERE (greenhouse_id = '2') AND (created_at >= '2018-08-28 08:51:30.966582')
SELECT `readings`.* FROM `readings` WHERE (greenhouse_id = 1) AND (created_at >= '2018-08-27 23:41:28.096894')

  def get_months
    # GET Method to retreive the decision added in last X months
    begin
      months = params[:months].to_i
    rescue
        render json: {status: 'ERROR', message: "Months argument must be a integer", data: 0},status: :ok
        return true
    end

    if months <= 0
      render json: {status: 'ERROR', message: "Months argument must be a integer higher than 0", data: 0},status: :ok
      return true
    end

    if Reading.count == 0
      render json: {status: 'ERROR', message: 'No readings found', data: 0},status: :ok
      return true
    end

    months_readings = Reading.where('created_at >= ?', Time.zone.now - months.months)
---
SELECT COUNT(*) FROM `readings` WHERE (greenhouse_id = '2') AND (created_at >= '2018-08-04 08:57:17.070966')
SELECT `readings`.* FROM `readings` WHERE (greenhouse_id = '2') AND (created_at >= '2018-08-04 08:57:17.070966')

  def get_years
    # GET Method to retreive the decision added in last X years
    begin
      years = params[:years].to_i
    rescue
      render json: {status: 'ERROR', message: "Years argument must be a integer", data: 0},status: :ok
      return true
    end

    if years <= 0
      render json: {status: 'ERROR', message: "Years argument must be a integer higher than 0", data: 0},status: :ok
      return true
    end

    if Reading.count == 0
      render json: {status: 'ERROR', message: 'No readings found', data: 0},status: :ok
      return true
    end

    years_readings = Reading.where('created_at >= ?', Time.zone.now - years.years)
---
SELECT COUNT(*) FROM `readings` WHERE (greenhouse_id = '2') AND (created_at >= '2017-09-04 08:57:24.826467')
SELECT `readings`.* FROM `readings` WHERE (greenhouse_id = 2) AND (created_at >= '2017-09-03 23:43:23.064474')