app/controllers/api/v1/sessions_controller.rb

	def login
		params.permit(:email, :password)
		user = User.where(email: params[:email]).first
		user.update(authentication_token: nil)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'a@a.com' ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `authentication_token` = 'bdkYEgdn_x_dNjsUWBRz', `updated_at` = '2018-08-24 13:18:13' WHERE `users`.`id` = 1

	def logout
		params.require('atoken')
		user = User.where(authentication_token: params[:atoken])
		if user.empty?
			render json: {status: 'ERROR', message: 'Token not valid', data: 0}, status: :unprocessable_entity
			return true
		else
			user.update(authentication_token: nil)
---
SELECT  `users`.* FROM `users` WHERE `users`.`authentication_token` = 'rtQbYPGURduqy6Gc75Sz' ORDER BY `users`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `users` WHERE `users`.`authentication_token` = '5Z6Xbscu_K6xh7V4UPAy'
UPDATE `users` SET `updated_at` = '2018-08-24 14:02:19', `authentication_token` = 'bBYyu898crJmYoDRZEPG' WHERE `users`.`id` = 1