app/controllers/api/v1/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`authentication_token` = 'asd' LIMIT 11
---
	def logout
		user = User.where(authentication_token: params[:atoken]).first